In [1]:
import pandas as pd

In [2]:
# Reading in the csv
# A dataframe is a 2-dimensional data structure (data represented in rows and columns)

df = pd.read_csv('./iris.csv')
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           NaN          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [3]:
# check the number of rows and columns
df.shape

(150, 5)

In [4]:
# check the datatypes of columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  149 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       149 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [5]:
# note that the rows are truncated
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             NaN          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8        NaN

[150 rows x 5 columns]

In [6]:
# we can set the maximum number of rows we want to see
pd.set_option('display.max_rows', 20)

In [7]:
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             NaN          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8        NaN

[150 rows x 5 columns]

In [8]:
# creating a dataframe from a dictionary
# A dataframe can be thought of as a dictionary but with much more additional functionality
employees = {
    'name': ['Sally', 'Micheal', 'Jim'],
    'age': [24, 26, 32],
    'job': ['ATRM', 'Regional Manager', 'Salesman']
}

In [9]:
employees['age']

[24, 26, 32]

In [10]:
employees_df = pd.DataFrame(employees)
employees_df

      name  age               job
0    Sally   24              ATRM
1  Micheal   26  Regional Manager
2      Jim   32          Salesman

In [12]:
# Following is the object of series. (series of rows of a single column)
employees_df['name']

0      Sally
1    Micheal
2        Jim
Name: name, dtype: object